app/views/purchases/new.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]
---
        <label>Select Categories:</label>
        <% @user.categories.each do |category| %>