app/controllers/categories_controller.rb

SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" IN ($1, $2)  [["id", 2], ["id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]
---
  def index
    if current_user
      # Retrieve the user along with their associated categories and purchases.
      @user = User.includes(categories: :purchases).find(current_user.id)
      @totals = []
      @user.categories.each do |cat|

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "purchases".* FROM "purchases" WHERE "purchases"."id" IN ($1, $2)  [["id", 2], ["id", 3]]
---
  def show
    @category = Category.includes(:purchases).find(params[:id])

INSERT INTO "categories" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "wds"], ["icon", "wsx"], ["user_id", 1], ["created_at", "2023-11-13 14:40:45.822250"], ["updated_at", "2023-11-13 14:40:45.822250"]]
---
  def create
    @category = Category.new(category_params)
    @category.user_id = current_user.id
    if @category.save