app/controllers/purchases_controller.rb

  def new
    @purchase = Purchase.new
    @category = Category.find(params[:category_id])
    @user = User.includes(:categories).find(current_user.id)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @purchase = Purchase.new(purchase_params)
    @purchase.author_id = current_user.id
    @category = Category.find(params[:category_id])

    if @purchase.save
      selected_category_ids = params[:purchase][:category_ids]
      if selected_category_ids
        selected_category_ids.each do |category_id|
          CategoryPurchase.create(purchase_id: @purchase.id, category_id:)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "purchases" ("name", "amount", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "3re"], ["amount", "22.0"], ["author_id", 1], ["created_at", "2023-11-13 14:41:09.460082"], ["updated_at", "2023-11-13 14:41:09.460082"]]
INSERT INTO "category_purchases" ("category_id", "purchase_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["category_id", 1], ["purchase_id", 2], ["created_at", "2023-11-13 14:41:17.631820"], ["updated_at", "2023-11-13 14:41:17.631820"]]